package com.appline.idea.java.courses.tasks.firstprogram;

/**
 * Задача №1 - Первая программа
 * <p>
 * Вывести на консоль текст “Hello World!”:
 * <p>
 * Скачать и установить IntelliJ IDEA.
 * <p>
 * Написать первую программу, которая выводит в консоль строку “Hello World!”.
 * <p>
 * Подключиться к GitHub, залить программу в созданный репозиторий.
 */

public class task1 {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}
